plinkysynth/plinky_public/sw/plinkyblack.ioc
ADC1.SamplingTime-4\#ChannelRegularConversion=ADC_SAMPLETIME_24CYCLES_5
Mcu.IP17=USB_OTG_FS
ADC1.Channel-6\#ChannelRegularConversion=ADC_CHANNEL_13
ADC1.Rank-2\#ChannelRegularConversion=3
Mcu.IP14=TIM6
Mcu.IP13=TIM5
PE13.Signal=TSC_G5_IO4
Mcu.IP16=USART3
Mcu.IP15=TSC
RCC.VCOInputFreq_Value=8000000
PD0.PinState=GPIO_PIN_RESET
PE8.Locked=true
Dma.SPI2_RX.3.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
PB5.Mode=G2_IO2-Channel
File.Version=6
Dma.ADC1.1.Priority=DMA_PRIORITY_LOW
PC13.GPIO_PuPd=GPIO_PULLUP
SAI1.InitProtocol-SAI_A_MasterWithClock=Enable
RCC.PLLSAI2N=14
SH.ADCx_IN13.ConfNb=1
PB7.Signal=TSC_G2_IO4
Dma.ADC1.1.Mode=DMA_CIRCULAR
TSC.PulseGeneratorPrescaler=TSC_PG_PRESC_DIV2
PB8.Locked=true
TSC.SamplingIOs-G5_IO1=TSC_GROUP5_IO1
PE4.Mode=G7_IO3-Channel
SH.S_TIM3_CH1.0=TIM3_CH1,PWM Generation1 CH1
TIM6.Period=12000
SH.ADCx_IN6.ConfNb=1
TIM4.OCFastMode_PWM-PWM\ Generation2\ CH2=TIM_OCFAST_ENABLE
Dma.SPI2_TX.2.MemDataAlignment=DMA_MDATAALIGN_BYTE
PE4.Signal=TSC_G7_IO3
PE6.GPIOParameters=GPIO_Label
Dma.RequestsNb=7
PB0.Locked=true
TSC.SpreadSpectrumPrescaler=TSC_SS_PRESC_DIV1
ProjectManager.ProjectName=plinkyblack
PD7.GPIO_Label=N3
SAI1.OutputDrive-SAI_A_MasterWithClock=SAI_OUTPUTDRIVE_ENABLE
PA6.Signal=S_TIM3_CH1
PB12.Mode=G1_IO1-Sampling
PA7.Locked=true
TSC.ChannelIOs-G1_IO4=TSC_GROUP1_IO4
Dma.SPI2_TX.2.Priority=DMA_PRIORITY_HIGH
TSC.ChannelIOs-G1_IO2=TSC_GROUP1_IO2
TSC.ChannelIOs-G1_IO3=TSC_GROUP1_IO3
Dma.USART3_TX.5.Priority=DMA_PRIORITY_LOW
Dma.SAI1_A.0.MemDataAlignment=DMA_MDATAALIGN_HALFWORD
Dma.ADC1.1.Direction=DMA_PERIPH_TO_MEMORY
RCC.EnbaleCSS=true
PD5.GPIO_Label=N2
ProjectManager.ToolChainLocation=
PD14.Locked=true
RCC.LSI_VALUE=32000
Dma.ADC1.1.MemInc=DMA_MINC_ENABLE
USB_OTG_FS.VirtualMode=Device_Only
ADC1.OffsetNumber-1\#ChannelRegularConversion=ADC_OFFSET_NONE
SPI2.CLKPhase=SPI_PHASE_2EDGE
PE0.GPIO_Label=CS2
PC14-OSC32_IN\ (PC14).Locked=true
Dma.SPI2_RX.3.Mode=DMA_NORMAL
SH.ADCx_IN1.0=ADC1_IN1,IN1-Single-Ended
Dma.Request2=SPI2_TX
Dma.Request1=ADC1
Dma.Request4=SAI1_B
Dma.Request3=SPI2_RX
USART3.OverrunDisableParam=ADVFEATURE_OVERRUN_DISABLE
Dma.Request6=USART3_RX
Dma.SPI2_RX.3.PeriphInc=DMA_PINC_DISABLE
Dma.Request5=USART3_TX
SPI2.Direction=SPI_DIRECTION_2LINES
PC5.Signal=ADCx_IN14
PE7.Signal=SAI1_SD_B
PD6.Signal=SAI1_SD_A
Dma.SPI2_TX.2.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
SH.COMP_DAC11_group.ConfNb=1
ADC1.Rank-6\#ChannelRegularConversion=7
Dma.Request0=SAI1_A
PE3.Mode=G7_IO2-Channel
Dma.SAI1_B.4.Direction=DMA_PERIPH_TO_MEMORY
VP_TIM3_VS_ClockSourceINT.Mode=Internal
Mcu.Pin84=VP_TIM1_VS_ClockSourceINT
Mcu.Pin85=VP_TIM2_VS_ClockSourceINT
PB3\ (JTDO-TRACESWO).Locked=true
Mcu.Pin82=VP_SAI1_VP_$IpInstance_SAIB_SAI_BASIC
RCC.PLLSAI1N=12
Mcu.Pin83=VP_SYS_VS_Systick
PA3.Signal=S_TIM2_CH4
Mcu.Pin88=VP_TIM5_VS_ClockSourceINT
Mcu.Pin89=VP_TIM6_VS_ClockSourceINT
Mcu.Pin86=VP_TIM3_VS_ClockSourceINT
PA2.Locked=true
Mcu.Pin87=VP_TIM4_VS_ClockSourceINT
RCC.MSI_VALUE=4000000
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
PA14\ (JTCK-SWCLK).Mode=Serial_Wire
Dma.USART3_RX.6.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
PE8.GPIOParameters=GPIO_PuPd,GPIO_Label
TIM2.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
SH.ADCx_IN13.0=ADC1_IN13,IN13-Single-Ended
TIM4.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_DISABLE
PD15.GPIO_Label=N5
ADC1.Channel-4\#ChannelRegularConversion=ADC_CHANNEL_5
ProjectManager.NoMain=false
Dma.SAI1_A.0.Direction=DMA_MEMORY_TO_PERIPH
PC11.Signal=TSC_G3_IO3
ADC1.OffsetNumber-3\#ChannelRegularConversion=ADC_OFFSET_NONE
PC8.Signal=TSC_G4_IO3
PC4.Signal=ADCx_IN13
PC10.Mode=G3_IO2-Sampling
VP_TIM6_VS_ClockSourceINT.Mode=Enable_Timer
TSC.ChannelIOs-G4_IO4=TSC_GROUP4_IO4
Dma.SPI2_RX.3.MemDataAlignment=DMA_MDATAALIGN_BYTE
TSC.ChannelIOs-G4_IO3=TSC_GROUP4_IO3
ProjectManager.DefaultFWLocation=true
PC15-OSC32_OUT\ (PC15).Signal=GPIO_Input
PD9.Signal=USART3_RX
PD5.Signal=GPIO_Output
TSC.ChannelIOs-G4_IO2=TSC_GROUP4_IO2
ProjectManager.DeletePrevious=true
PB10.Locked=true
RCC.VCOSAI2OutputFreq_Value=112000000
Dma.SAI1_A.0.MemInc=DMA_MINC_ENABLE
TIM4.OCFastMode_PWM-PWM\ Generation3\ CH3=TIM_OCFAST_ENABLE
SH.S_TIM3_CH3.0=TIM3_CH3,PWM Generation3 CH3
ADC1.SamplingTime-2\#ChannelRegularConversion=ADC_SAMPLETIME_24CYCLES_5
RCC.FamilyName=M
PH1-OSC_OUT\ (PH1).Signal=RCC_OSC_OUT
TIM1.OCFastMode_PWM-PWM\ Generation2\ CH2=TIM_OCFAST_ENABLE
PE15.GPIOParameters=GPIO_PuPd,GPIO_Label
Dma.USART3_RX.6.MemInc=DMA_MINC_ENABLE
Dma.SPI2_RX.3.MemInc=DMA_MINC_ENABLE
TSC.SamplingIOs-G2_IO1=TSC_GROUP2_IO1
SAI1.RealAudioFreq-SAI_A_MasterWithClock=31.25 KHz
SH.S_TIM2_CH2.0=TIM2_CH2,PWM Generation2 CH2
PE0.PinState=GPIO_PIN_SET
TIM6.IPParameters=Period,TIM_MasterOutputTrigger
SH.S_TIM1_CH1.0=TIM1_CH1,PWM Generation1 CH1
PE15.GPIO_Label=SENSE2
VP_TIM4_VS_ClockSourceINT.Signal=TIM4_VS_ClockSourceINT
NVIC.DMA1_Channel2_IRQn=true\:0\:0\:false\:false\:true\:false\:true
ProjectManager.TargetToolchain=STM32CubeIDE
Dma.SAI1_A.0.Mode=DMA_CIRCULAR
SH.S_TIM3_CH3.ConfNb=1
Dma.SPI2_TX.2.Direction=DMA_MEMORY_TO_PERIPH
SH.S_TIM4_CH3.0=TIM4_CH3,PWM Generation3 CH3
PB9.Mode=SAI_A_MasterWithClock
PB2.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultEXTI
ADC1.Channel-1\#ChannelRegularConversion=ADC_CHANNEL_2
TSC.SpreadSpectrumDeviation=32
SPI2.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler,DataSize,CLKPolarity,CLKPhase
ProjectManager.RegisterCallBack=
PC15-OSC32_OUT\ (PC15).Locked=true
PE0.Locked=true
RCC.USBFreq_Value=48000000
TIM2.OCFastMode_PWM-PWM\ Generation3\ CH3=TIM_OCFAST_ENABLE
VP_TIM3_VS_ClockSourceINT.Signal=TIM3_VS_ClockSourceINT
ADC1.Ratio=ADC_OVERSAMPLING_RATIO_16
PE11.Signal=TSC_G5_IO2
RCC.LSE_VALUE=32768
PA1.Signal=ADCx_IN6
SH.S_TIM1_CH2.ConfNb=1
Dma.SAI1_A.0.Priority=DMA_PRIORITY_LOW
SH.S_TIM4_CH3.ConfNb=1
SH.S_TIM3_CH2.0=TIM3_CH2,PWM Generation2 CH2
board=custom
SAI1.IPParameters=Instance-SAI_A_MasterWithClock,VirtualMode-SAI_A_MasterWithClock,MClockEnable-SAI_A_MasterWithClock,RealAudioFreq-SAI_A_MasterWithClock,ErrorAudioFreq-SAI_A_MasterWithClock,InitProtocol-SAI_A_MasterWithClock,VirtualProtocol-SAI_A_BASIC,AudioFrequency-SAI_A_MasterWithClock,FIFOThreshold-SAI_A_MasterWithClock,OutputDrive-SAI_A_MasterWithClock,Instance-SAI_B_SyncSlave,VirtualMode-SAI_B_SyncSlave,InitProtocol-SAI_B_SyncSlave,VirtualProtocol-SAI_B_BASIC
RCC.VCOOutputFreq_Value=224000000
Dma.SPI2_RX.3.Instance=DMA1_Channel4
PB15.Mode=G1_IO4-Channel
PC15-OSC32_OUT\ (PC15).GPIO_PuPd=GPIO_PULLUP
TIM4.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
RCC.APB2Freq_Value=56000000
RCC.UART4Freq_Value=56000000
MxCube.Version=5.6.1
SH.S_TIM1_CH2.0=TIM1_CH2,PWM Generation2 CH2
VP_TIM2_VS_ClockSourceINT.Mode=Internal
SH.S_TIM2_CH3.0=TIM2_CH3,PWM Generation3 CH3
PC13.GPIOParameters=GPIO_PuPd,GPIO_Label
PE1.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
RCC.INSTRUCTION_CACHE_ENABLE=1
PE5.Mode=SAI_A_MasterWithClock
SH.ADCx_IN2.ConfNb=1
RCC.PLLSAI1QoutputFreq_Value=48000000
RCC.ADCFreq_Value=56000000
VP_SYS_VS_Systick.Mode=SysTick
TIM2.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
TSC.IPParameters=SamplingIOs-G1_IO1,ChannelIOs-G1_IO2,ChannelIOs-G1_IO3,ChannelIOs-G1_IO4,SamplingIOs-G2_IO1,ChannelIOs-G2_IO2,ChannelIOs-G2_IO3,ChannelIOs-G2_IO4,ChannelIOs-G3_IO3,SamplingIOs-G3_IO2,ChannelIOs-G3_IO4,SamplingIOs-G4_IO1,ChannelIOs-G4_IO2,ChannelIOs-G4_IO3,ChannelIOs-G4_IO4,SamplingIOs-G5_IO1,ChannelIOs-G5_IO2,ChannelIOs-G5_IO3,ChannelIOs-G5_IO4,SamplingIOs-G6_IO1,ChannelIOs-G6_IO2,ChannelIOs-G6_IO3,SamplingIOs-G7_IO1,ChannelIOs-G7_IO2,ChannelIOs-G7_IO3,SpreadSpectrum,SpreadSpectrumDeviation,PulseGeneratorPrescaler,CTPulseHighLength,CTPulseLowLength,SpreadSpectrumPrescaler,MaxCountValue
TIM6.TIM_MasterOutputTrigger=TIM_TRGO_UPDATE
Dma.USART3_RX.6.Priority=DMA_PRIORITY_LOW
Dma.ADC1.1.PeriphInc=DMA_PINC_DISABLE
DAC1.DAC_Trigger-DAC_OUT2=DAC_TRIGGER_NONE
DAC1.DAC_Trigger-DAC_OUT1=DAC_TRIGGER_NONE
PE6.Signal=S_TIM3_CH4
RCC.UART5Freq_Value=56000000
ADC1.NbrOfConversion=8
ADC1.OffsetNumber-2\#ChannelRegularConversion=ADC_OFFSET_NONE
RCC.IPParameters=ADCCLockSelection,ADCFreq_Value,AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimFreq_Value,CortexFreq_Value,DATA_CACHE_ENABLE,DFSDMFreq_Value,EnbaleCSS,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,INSTRUCTION_CACHE_ENABLE,LPTIM1Freq_Value,LPTIM2Freq_Value,LPUART1Freq_Value,LSCOPinFreq_Value,LSE_VALUE,LSI_VALUE,MCO1PinFreq_Value,MSI_VALUE,PLLM,PLLN,PLLPoutputFreq_Value,PLLQoutputFreq_Value,PLLRCLKFreq_Value,PLLSAI1N,PLLSAI1PoutputFreq_Value,PLLSAI1QoutputFreq_Value,PLLSAI1RoutputFreq_Value,PLLSAI2N,PLLSAI2PoutputFreq_Value,PLLSAI2RoutputFreq_Value,PLLSourceVirtual,PREFETCH_ENABLE,PWRFreq_Value,RNGFreq_Value,SAI1CLockSelection,SAI1Freq_Value,SAI2Freq_Value,SDMMCFreq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,UART4Freq_Value,UART5Freq_Value,USART1Freq_Value,USART2Freq_Value,USART3CLockSelection,USART3Freq_Value,USBFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAI1OutputFreq_Value,VCOSAI2OutputFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32L476V(C-E-G)Tx
PE0.Signal=GPIO_Output
PE12.Signal=TSC_G5_IO3
PA2.Signal=S_TIM2_CH3
ADC1.OffsetNumber-6\#ChannelRegularConversion=ADC_OFFSET_NONE
PB2.Locked=true
Mcu.IP8=SYS
Mcu.IP9=TIM1
PD14.Signal=S_TIM4_CH3
Mcu.IP6=SAI1
Mcu.IP7=SPI2
ProjectManager.CoupleFile=false
RCC.SYSCLKFreq_VALUE=112000000
TSC.ChannelIOs-G3_IO4=TSC_GROUP3_IO4
PE7.Mode=SAI_B_SyncSlave
TSC.ChannelIOs-G3_IO3=TSC_GROUP3_IO3
PA12.Mode=Device_Only
ADC1.Rank-3\#ChannelRegularConversion=4
ADC1.SamplingTime-3\#ChannelRegularConversion=ADC_SAMPLETIME_24CYCLES_5
RCC.PLLSAI2PoutputFreq_Value=16000000
KeepUserPlacement=false
Dma.SPI2_RX.3.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
TIM5.Prescaler=80
TSC.SamplingIOs-G3_IO2=TSC_GROUP3_IO2
PC14-OSC32_IN\ (PC14).Signal=GPIO_Input
SAI1.Instance-SAI_B_SyncSlave=SAI$Index_Block_B
PB7.Mode=G2_IO4-Channel
PB2.GPIO_Label=CLKIN
PE15.GPIO_PuPd=GPIO_PULLUP
SH.S_TIM2_CH4.0=TIM2_CH4,PWM Generation4 CH4
Dma.USART3_TX.5.MemDataAlignment=DMA_MDATAALIGN_BYTE
PD11.Mode=G6_IO2-Channel
SH.S_TIM1_CH3.0=TIM1_CH3,PWM Generation3 CH3
NVIC.I2C2_EV_IRQn=true\:0\:0\:false\:false\:true\:true\:true
RCC.HSI_VALUE=16000000
PA8.GPIO_PuPd=GPIO_PULLUP
PC14-OSC32_IN\ (PC14).GPIOParameters=GPIO_PuPd,GPIO_Label
ADC1.Rank-7\#ChannelRegularConversion=8
SH.S_TIM3_CH4.ConfNb=1
ADC1.NbrOfConversionFlag=1
RCC.PLLM=2
RCC.PLLN=28
PB8.Signal=SAI1_MCLK_A
TIM5.Period=4294967295
PC9.Signal=TSC_G4_IO4
ADC1.SamplingTime-7\#ChannelRegularConversion=ADC_SAMPLETIME_24CYCLES_5
PC7.Mode=G4_IO2-Channel
PA15\ (JTDI).Locked=true
PD9.Locked=true
RCC.APB1Freq_Value=56000000
SAI1.InitProtocol-SAI_B_SyncSlave=Enable
ADC1.ClockPrescaler=ADC_CLOCK_ASYNC_DIV2
PB11.Locked=true
ProjectManager.DeviceId=STM32L476VGTx
Dma.SPI2_RX.3.Direction=DMA_PERIPH_TO_MEMORY
PB12.Signal=TSC_G1_IO1
ProjectManager.LibraryCopy=1
PE1.GPIOParameters=GPIO_Speed,PinState,GPIO_Label
SH.S_TIM3_CH4.0=TIM3_CH4,PWM Generation4 CH4
PA7.Signal=S_TIM3_CH2
PB4\ (NJTRST).Signal=TSC_G2_IO1
PA6.Locked=true
isbadioc=false
